{
  "type": "naval",
  "name": "Carrier Flagship",
  "description": "A water flagship carrier. Equipped with just a simple energy arc weapon but creates Horizon and Zenith units and has a healing field.",
  "details": "Somewhere out in the ocean high above the surface swirling masses of gray clouds hide the sight of a star dotted sky and the sounds of waves of water crashing into a ship is heard loudly, under cloudy night sky a dimly lit object sails with one goal: find whatever might be lurking on their world. Just mere hours later however the ping that indicated the presence of the unit disappeared from every nearby outpost. \n \n Originally not intended to be sent directly to the frontline, the Carrier Flagship was none the less sent, perhaps the Main core believed in its capabilties or perhaps there was were no other available units in the area, whatever the case maybe, all that remained of the proud vessel was a blazing wreck, scarred with weaponry never seen before. However, when the news struck it was overshadowed by a another event, one that escalated tensions to dangerous levels between the two major powers of the Cluster. \n \ n While the Cluster was on a knife edge on the brink of war, agents discreetly removed any record of the destruction of the Carrier Flagship. Nonetheless, despite the best efforts of these 'agents', news regarding its destruction would trickle into the infostream rapidly catching the attention of many leaders turning the focus from the escalation event, to Serpulo as the heads of both states sought to de escalate the current political state of the Cluster. But in spite of all the agents skills, one would get caught eventually unraveling a massive out reaching conspiracy. While the captured agent did not specify who was in this conspiracy only revealing that some on both sides are involved, those few who received this info on both sides understands what this implies, any sort of leak could and likely would spark a war between them, a war that would engulf the Cluster, a war on the scale of spanning many systems, and a war built on lies",
  "drag": 0.15,
  "speed": 2.7,
  "naval": true,
  "buildRange": 80,
  "buildSpeed": 5,
  "itemCapacity": 100,
  "range": 320,
  "itemCapacity": 100,
  "defaultCommand": "assistCommand",
  "category": "unit",
  "research": {
    "parent": "king",
    "requirements": [
      {
        "item": "silicon",
        "amount": 200
      },
      {
        "item": "plastanium",
        "amount": 150
      },
      {
        "item": "surge-alloy",
        "amount": 100
      },
      {
        "item": "phase-fabric",
        "amount": 150
      }
    ]
  },
  "maxVelocity": 0.95,
  "mass": 10,
  "commandLimit": 10,
  "health": 5800,
  "armor": 9,
  "rotateWeapon": false,
  "rotatespeed": 0.03,
  "weapons": [
    {
      "name": "nothing",
      "x": 4,
      "y": 2,
      "reload": 10,
      "alternate": true,
      "mirror": true,
      "rotate": true,
      "rotateSpeed": 20,
      "range": 64,
      "bullet": {
        "type": "LightningBulletType",
        "damage": 15,
        "lightningColor": "13d5c8",
        "lightningLength": 26,
        "lightning": 2,
        "lightningAngle": 10,
        "lightningDamage": 5
      }
    }
  ],
  "abilities": [
    {
      "type": "UnitSpawnAbility",
      "unit": "zenith",
      "spawnX": 0,
      "spawnY": -1,
      "spawnTime": 1200
    },
    {
      "type": "UnitSpawnAbility",
      "unit": "horizon",
      "spawnX": 0,
      "spawnY": -1,
      "spawnTime": 300
    },
    {
      "type": "RepairFieldAbility",
      "amount": 30,
      "range": 48,
      "reload": 60,
      "healEffect": {
        "type": "ParticleEffect",
        "particles": 8,
        "colorFrom": "87e422",
        "colorTo": "70b921",
        "interp": "circleIn",
      },
      "activeEffect": {
        "type": "WaveEffect",
        "sizeFrom": 0,
        "sizeTo": 40,
        "colorFrom": "87e422",
        "colorTo": "70b921"
      }
    }
  ],
  "hitSize": 28
}
